# 1.PySpark Connection part

In [1]:
#Connection part for Pyspark and importing required packages.
import pandas as pd
import numpy as np

from pyspark.sql import SparkSession
from pyspark.sql.types import *
from pyspark.sql.functions import *
from pyspark.sql import *

spark = SparkSession.builder.appName("Pyspark_VS_Pandas").getOrCreate()
conf = spark.sparkContext._conf.setAll([('spark.driver.memory', '4g'), ('spark.executor.memory', '4g'), ('spark.executor.num','6'), ('spark.network.timeout', '1000000')])

# 2.Reading data into Pyspark dataframe

In [2]:
#Creating Pyspark dataframe so that we apply SQL scripts for our practice
#    1.Read it into Pandas df
#    2.convert into pyspark df by defining datatypes of each columns
#    [we can use spark.read.format("") option, but it requires additional packages installation so skipped this way]

#####################################################################################################
#1.STUDENT
student_dfpd = pd.read_excel(r'Table_Source\Student_Placement_Table.xlsx')
schema_student = StructType([\
                     StructField("ID",IntegerType(),False),\
                     StructField("Name",StringType(),False),\
                     StructField("Gender",StringType(),False),\
                     StructField("DOB",DateType(),False),\
                     StructField("Location",StringType(),True),\
                     StructField("University",StringType(),False),\
                     StructField("Salary",DoubleType(),False),\
                     StructField("Company",StringType(),False),\
                     StructField("Email",StringType(),False)])

student_dfps = spark.createDataFrame(student_dfpd, schema_student)

#####################################################################################################
#2.UNIVERSITY
university_dfpd = pd.read_excel(r'Table_Source\University_Table.xlsx')
schema_university = StructType([\
                     StructField("University",StringType(),False),\
                     StructField("MinSalary",StringType(),False),\
                     StructField("PlayGround",StringType(),False),\
                     StructField("Total_Students",IntegerType(),False)])
university_dfps = spark.createDataFrame(university_dfpd, schema_university)

#####################################################################################################
#3.COMPANY
company_dfpd = pd.read_excel(r'Table_Source\Company_Table.xlsx')
schema_company = StructType([\
                     StructField("Company",StringType(),False),\
                     StructField("Total_Employes",IntegerType(),False),\
                     StructField("Total_Products",IntegerType(),False),\
                     StructField("Hike_Per_Anum",IntegerType(),False),\
                     StructField("WHF_Office",StringType(),False)])
company_dfps = spark.createDataFrame(company_dfpd, schema_company)
#####################################################################################################

# 3.PySpark DataFrame to TempView + Columns datatype

In [3]:
#A. Create pyspark dataframe into Temporary view for applying SQL scripts
student_dfps.createOrReplaceTempView("Student_Table")
university_dfps.createOrReplaceTempView("University_Table")
company_dfps.createOrReplaceTempView("Company_Table")

##### 1. Student_Table

In [4]:
#print student table schema
print("Student_Table Schema:")
student_dfps.printSchema()

#print total count of records 
print("Total records of Student_Table = ",student_dfps.count(),"\n\nStudent_Table Data:")

#List all the records in table
sql_query = "SELECT * FROM Student_Table"
spark.sql(sql_query).show(30)

Student_Table Schema:
root
 |-- ID: integer (nullable = false)
 |-- Name: string (nullable = false)
 |-- Gender: string (nullable = false)
 |-- DOB: date (nullable = false)
 |-- Location: string (nullable = true)
 |-- University: string (nullable = false)
 |-- Salary: double (nullable = false)
 |-- Company: string (nullable = false)
 |-- Email: string (nullable = false)

Total records of Student_Table =  24

Student_Table Data:
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|102| BBB|     F|1995-09-20|     HYD|      IIIT|76000.2|   Amazon|BBB@hotmail.com|
|103| CCC|     M|1992-12-31| Chennai|       NIT|49200.5|   Google|  CCC@gmail.com|
|104| DDD|     F|1990-11-22|  Mumbai|       VIT|54980.6|    Apple|DDD@hotmail.com|
|105| EEE|     M|1993-05-19| Chennai|       IIT|60200.7|Microsoft|  EEE@gmail.com|
|106| FFF|     M|1994-07-23|     HYD|      IIIT|63100.8|Microsoft|  FFF@gmail.com|
|107| GGG|     F|1994-10-10|  Mumbai|       VIT|60200.7|   Amazon|GGG@hotmail.com|
|108| HHH|     M|1990-10-10|Banglore|       NIT|89200.7|    Apple|  HHH@gmail.com|
|109| III|     F|1994-12-21|     HYD|      IIIT|66980.8|   Google|  III@gmail.com|
|110| JJJ|     M|1990-11-22| Chennai|       NIT|59250.2|   Amazon|JJJ@hotmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|112| LLL|     F|1995-09-20|  Mumbai|       NIT|67900.8|    Apple|  LLL@gmail.com|
|113| MMM|     F|1994-10-15|     NaN|       VIT|60200.7|   Google|MMM@hotmail.com|
|114| NNN|     F|1990-11-29|Banglore|      IIIT|59200.5|   Amazon|  NNN@gmail.com|
|115| OOO|     M|1995-09-20|Banglore|      IISC|57120.5|   Google|  OOO@gmail.com|
|116| PPP|     F|1994-10-28| Chennai|       IIT|59050.5|    Apple|  PPP@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|118| RRR|     F|1993-11-10|  Mumbai|       NIT|52900.5|   Google|  RRR@gmail.com|
|119| SSS|     M|1992-10-25|     NaN|       VIT|62900.5|Microsoft|  SSS@gmail.com|
|120| TTT|     M|1995-09-29| Chennai|      IIIT|57230.5|    Apple|TTT@hotmail.com|
|121| UUU|     F|1990-11-13| Chennai|       NIT|59250.2|   Google|  UUU@gmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
|123| WWW|     F|1994-09-14|  Mumbai|       VIT|59050.5|    Apple|WWW@hotmail.com|
|124| XXX|     M|1991-12-19|     HYD|       IIT|60200.7|Microsoft|  XXX@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### 2. University_Table

In [5]:
#print university table schema
print("University_Table Schema:")
university_dfps.printSchema()

#print total count of records 
print("Total records of University_Table = ",university_dfps.count(),"\n\nUniversity_Table Data:")

#List all the records in table
sql_query = "SELECT * FROM University_Table"
spark.sql(sql_query).show(30)

University_Table Schema:
root
 |-- University: string (nullable = false)
 |-- MinSalary: string (nullable = false)
 |-- PlayGround: string (nullable = false)
 |-- Total_Students: integer (nullable = false)

Total records of University_Table =  5

University_Table Data:
+----------+---------+----------+--------------+
|University|MinSalary|PlayGround|Total_Students|
+----------+---------+----------+--------------+
|      IISC|      35K|       YES|           250|
|      IIIT|      37K|       YES|           300|
|       MIT|      32K|       YES|           230|
|       IIT|      38K|       YES|           240|
|      JNTU|      33K|        NO|           250|
+----------+---------+----------+--------------+

##### 3. Company_Table

In [6]:
#print company table schema
print("Company_Table Schema:")
company_dfps.printSchema()

#print total count of records 
print("Total records of Company_Table = ",company_dfps.count(),"\n\nCompany_Table Data:")

#List all the records in table
sql_query = "SELECT * FROM Company_Table"
spark.sql(sql_query).show(30)

Company_Table Schema:
root
 |-- Company: string (nullable = false)
 |-- Total_Employes: integer (nullable = false)
 |-- Total_Products: integer (nullable = false)
 |-- Hike_Per_Anum: integer (nullable = false)
 |-- WHF_Office: string (nullable = false)

Total records of Company_Table =  6

Company_Table Data:
+---------+--------------+--------------+-------------+----------+
|  Company|Total_Employes|Total_Products|Hike_Per_Anum|WHF_Office|
+---------+--------------+--------------+-------------+----------+
|Microsoft|         25000|            50|           25|       WFH|
|      TCS|        450000|            20|           20|    Office|
|  Infosys|        350000|            19|           18|    Office|
|   Google|         30000|            55|           25|       WFH|
|   Amazon|        150000|            25|           22|    Office|
|    Apple|        200000|            30|           21|       WFH|
+---------+--------------+--------------+-------------+----------+

# 😎

# 4.SQL Practice starts here

# @##############################################################@

# 4A.Select statement + Alias names + Limit + Count(*)

##### SELECT

In [7]:
#Select statement used to select(Print) data 
#We can give perticular column names to print, or use * to print all columns
# Table name = Student_Table
#show(5) for limiting records tobe printed

print("4A1). Print only ID, NAME, GENDER columns")
sql_query="""SELECT ID, NAME, GENDER FROM Student_Table"""
spark.sql(sql_query).show(5)

4A1). Print only ID, NAME, GENDER columns
+---+----+------+
| ID|NAME|GENDER|
+---+----+------+
|101| AAA|     M|
|102| BBB|     F|
|103| CCC|     M|
|104| DDD|     F|
|105| EEE|     M|
+---+----+------+
only showing top 5 rows

##### SELECT *

In [8]:
#use * for printing all columns data to console, ##show(5) for limiting records tobe printed
print("4A2). Print all columns from table")

sql_query="""SELECT * FROM Student_Table"""
spark.sql(sql_query).show(5)

4A2). Print all columns from table
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|102| BBB|     F|1995-09-20|     HYD|      IIIT|76000.2|   Amazon|BBB@hotmail.com|
|103| CCC|     M|1992-12-31| Chennai|       NIT|49200.5|   Google|  CCC@gmail.com|
|104| DDD|     F|1990-11-22|  Mumbai|       VIT|54980.6|    Apple|DDD@hotmail.com|
|105| EEE|     M|1993-05-19| Chennai|       IIT|60200.7|Microsoft|  EEE@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+
only showing top 5 rows

##### Alias names for columns

In [9]:
#Renaming columns with more meaningful names
print("4A3). Alias name for ID, Name columns")

sql_query="""SELECT ID as ID_Number, Name as Name_of_Student FROM Student_Table"""
spark.sql(sql_query).show(5)

4A3). Alias name for ID, Name columns
+---------+---------------+
|ID_Number|Name_of_Student|
+---------+---------------+
|      101|            AAA|
|      102|            BBB|
|      103|            CCC|
|      104|            DDD|
|      105|            EEE|
+---------+---------------+
only showing top 5 rows

##### LIMIT

In [10]:
#Limiting number of records with LIMIT
print("4A4). Limiting number of records tobe printing on console with Limit by 4")

sql_query="""SELECT * FROM Student_Table LIMIT 4"""
spark.sql(sql_query).show()

4A4). Limiting number of records tobe printing on console with Limit by 4
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|102| BBB|     F|1995-09-20|     HYD|      IIIT|76000.2|   Amazon|BBB@hotmail.com|
|103| CCC|     M|1992-12-31| Chennai|       NIT|49200.5|   Google|  CCC@gmail.com|
|104| DDD|     F|1990-11-22|  Mumbai|       VIT|54980.6|    Apple|DDD@hotmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### Count(*)

In [11]:
#Count(*) function used to return total number of records that are matching given criteria
    #if no filter given for count(*), it will print total records in given table

print("4A5). Print total records in given table")

sql_query="""SELECT count(*)as Total_Count FROM Student_Table"""
spark.sql(sql_query).show()

4A5). Print total records in given table
+-----------+
|Total_Count|
+-----------+
|         24|
+-----------+

##### Select random text

In [12]:
#Selectng some random text using select statement
print("4A6). Print some sample text using select statement")

sql_query="""SELECT 'Hello I am SQL' as Column_Name """
spark.sql(sql_query).show()

4A6). Print some sample text using select statement
+--------------+
|   Column_Name|
+--------------+
|Hello I am SQL|
+--------------+

## 4B.Distinct statement

In [13]:
#Distinct statement used for listing only distinct(different) values in column or list of columns

print("4B1). Without Distinct statement, it will lsit all reocrds in that column(s)")
sql_query="SELECT Location FROM Student_Table"
spark.sql(sql_query).show(30)


print("4B2). With Distinct statement, it will lsit only distinct reocrds in that column(s)")
sql_query="SELECT distinct Location FROM Student_Table"
spark.sql(sql_query).show(30)

4B1). Without Distinct statement, it will lsit all reocrds in that column(s)
+--------+
|Location|
+--------+
|Banglore|
|     HYD|
| Chennai|
|  Mumbai|
| Chennai|
|     HYD|
|  Mumbai|
|Banglore|
|     HYD|
| Chennai|
|Banglore|
|  Mumbai|
|     NaN|
|Banglore|
|Banglore|
| Chennai|
|Banglore|
|  Mumbai|
|     NaN|
| Chennai|
| Chennai|
|Banglore|
|  Mumbai|
|     HYD|
+--------+

4B2). With Distinct statement, it will lsit only distinct reocrds in that column(s)
+--------+
|Location|
+--------+
| Chennai|
|  Mumbai|
|     NaN|
|     HYD|
|Banglore|
+--------+

## 4C.WHERE clause + BETWEEN + LIKE + IN + AND + OR + IS NULL

##### WHERE

In [14]:
#Where clause used to filter reocrds based on given condition on columns
#Below query will filter records from location Banglore

print("4C1). Print records only from Banglore location")
sql_query="SELECT * FROM Student_Table WHERE Location = 'Banglore'"
spark.sql(sql_query).show(30)

4C1). Print records only from Banglore location
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|108| HHH|     M|1990-10-10|Banglore|       NIT|89200.7|    Apple|  HHH@gmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|114| NNN|     F|1990-11-29|Banglore|      IIIT|59200.5|   Amazon|  NNN@gmail.com|
|115| OOO|     M|1995-09-20|Banglore|      IISC|57120.5|   Google|  OOO@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### WHERE + BETWEEN

In [15]:
print("4C2). Print records only ID range from 105 to 109 Inclusive")

sql_query="""SELECT * FROM Student_Table WHERE ID BETWEEN 105 AND 109"""
spark.sql(sql_query).show(30)

4C2). Print records only ID range from 105 to 109 Inclusive
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|105| EEE|     M|1993-05-19| Chennai|       IIT|60200.7|Microsoft|  EEE@gmail.com|
|106| FFF|     M|1994-07-23|     HYD|      IIIT|63100.8|Microsoft|  FFF@gmail.com|
|107| GGG|     F|1994-10-10|  Mumbai|       VIT|60200.7|   Amazon|GGG@hotmail.com|
|108| HHH|     M|1990-10-10|Banglore|       NIT|89200.7|    Apple|  HHH@gmail.com|
|109| III|     F|1994-12-21|     HYD|      IIIT|66980.8|   Google|  III@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### WHERE + LIKE

In [16]:
print("4C3). Print records only Company value contains soft")

sql_query="""SELECT * FROM Student_Table WHERE COMPANY LIKE "%soft%" """
spark.sql(sql_query).show(30)

4C3). Print records only Company value contains soft
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|105| EEE|     M|1993-05-19| Chennai|       IIT|60200.7|Microsoft|  EEE@gmail.com|
|106| FFF|     M|1994-07-23|     HYD|      IIIT|63100.8|Microsoft|  FFF@gmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|119| SSS|     M|1992-10-25|     NaN|       VIT|62900.5|Microsoft|  SSS@gmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
|124| XXX|     M|1991-12-19|     HYD|       IIT|60200.7|Microsoft|  XXX@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### WHERE + IN

In [17]:
print("4C4). Print records only Name in given list(AAA, GGG, KKK)")

sql_query="""SELECT * FROM Student_Table WHERE NAME IN ('AAA', 'GGG', 'KKK') """
spark.sql(sql_query).show(30)

4C4). Print records only Name in given list(AAA, GGG, KKK)
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|107| GGG|     F|1994-10-10|  Mumbai|       VIT|60200.7|   Amazon|GGG@hotmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### WHERE + AND

In [18]:
#And should satisfy all conditions
print("4C5). Print records from Banglore location and Microsoft company")

sql_query="""SELECT * FROM Student_Table WHERE (LOCATION ='Banglore' AND COMPANY ='Microsoft') """
spark.sql(sql_query).show(30)

4C5). Print records from Banglore location and Microsoft company
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### WHERE + OR

In [19]:
#OR should satisfy any one conditions, Either of the condition will meet the output
print("4C6). Print records from Banglore location or Microsoft company")

sql_query="""SELECT * FROM Student_Table WHERE (LOCATION ='Banglore' OR COMPANY ='Microsoft') """
spark.sql(sql_query).show(30)

4C6). Print records from Banglore location or Microsoft company
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|105| EEE|     M|1993-05-19| Chennai|       IIT|60200.7|Microsoft|  EEE@gmail.com|
|106| FFF|     M|1994-07-23|     HYD|      IIIT|63100.8|Microsoft|  FFF@gmail.com|
|108| HHH|     M|1990-10-10|Banglore|       NIT|89200.7|    Apple|  HHH@gmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|114| NNN|     F|1990-11-29|Banglore|      IIIT|59200.5|   Amazon|  NNN@gmail.com|
|115| OOO|     M|1995-09-20|Banglore|      IISC|57120.5|   Google|  OOO@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|119| SSS|     M|1992-10-25|     NaN|       VIT|62900.5|Microsoft|  SSS@gmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
|124| XXX|     M|1991-12-19|     HYD|       IIT|60200.7|Microsoft|  XXX@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### WHERE + IS NULL + IS NOT NULL

In [20]:
#Is Null will filter given column having Null values, #Is Not Null will print having proper value
# Null is nothing but, missing value in any column(Except Primay key column), it will represent with some meaningful value

print("4C7). Print records where University is not null, Here all records will be printed because all rows are having Proper values in University column")

sql_query="""SELECT * FROM Student_Table WHERE University IS NOT NULL"""
spark.sql(sql_query).show(30)

4C7). Print records where University is not null, Here all records will be printed because all rows are having Proper values in University column
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|102| BBB|     F|1995-09-20|     HYD|      IIIT|76000.2|   Amazon|BBB@hotmail.com|
|103| CCC|     M|1992-12-31| Chennai|       NIT|49200.5|   Google|  CCC@gmail.com|
|104| DDD|     F|1990-11-22|  Mumbai|       VIT|54980.6|    Apple|DDD@hotmail.com|
|105| EEE|     M|1993-05-19| Chennai|       IIT|60200.7|Microsoft|  EEE@gmail.com|
|106| FFF|     M|1994-07-23|     HYD|      IIIT|63100.8|Microsoft|  FFF@gmail.com|
|107| GGG|     F|1994-10-10|  Mumbai|       VIT|60200.7|   Amazon|GGG@hotmail.com|
|108| HHH|     M|1990-10-10|Banglore|       NIT|89200.7|    Apple|  HHH@gmail.com|
|109| III|     F|1994-12-21|     HYD|      IIIT|66980.8|   Google|  III@gmail.com|
|110| JJJ|     M|1990-11-22| Chennai|       NIT|59250.2|   Amazon|JJJ@hotmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|112| LLL|     F|1995-09-20|  Mumbai|       NIT|67900.8|    Apple|  LLL@gmail.com|
|113| MMM|     F|1994-10-15|     NaN|       VIT|60200.7|   Google|MMM@hotmail.com|
|114| NNN|     F|1990-11-29|Banglore|      IIIT|59200.5|   Amazon|  NNN@gmail.com|
|115| OOO|     M|1995-09-20|Banglore|      IISC|57120.5|   Google|  OOO@gmail.com|
|116| PPP|     F|1994-10-28| Chennai|       IIT|59050.5|    Apple|  PPP@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|118| RRR|     F|1993-11-10|  Mumbai|       NIT|52900.5|   Google|  RRR@gmail.com|
|119| SSS|     M|1992-10-25|     NaN|       VIT|62900.5|Microsoft|  SSS@gmail.com|
|120| TTT|     M|1995-09-29| Chennai|      IIIT|57230.5|    Apple|TTT@hotmail.com|
|121| UUU|     F|1990-11-13| Chennai|       NIT|59250.2|   Google|  UUU@gmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
|123| WWW|     F|1994-09-14|  Mumbai|       VIT|59050.5|    Apple|WWW@hotmail.com|
|124| XXX|     M|1991-12-19|     HYD|       IIT|60200.7|Microsoft|  XXX@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

# 4D.Order By

##### ORDER BY ASE

In [21]:
#Bydefault it is Accending order, for descending order we have to use DESC keyword
    #Number: 0 to n bydefault, DESC: n to 0
    #Alphabets: A to Z bydefault, DESC: Z to A
    
print("4D1). Sort by Salary Accending order top 5 records")

sql_query="""SELECT * FROM Student_Table ORDER BY Salary LIMIT 5"""
spark.sql(sql_query).show()

4D1). Sort by Salary Accending order top 5 records
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|103| CCC|     M|1992-12-31| Chennai|       NIT|49200.5|   Google|  CCC@gmail.com|
|118| RRR|     F|1993-11-10|  Mumbai|       NIT|52900.5|   Google|  RRR@gmail.com|
|104| DDD|     F|1990-11-22|  Mumbai|       VIT|54980.6|    Apple|DDD@hotmail.com|
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|115| OOO|     M|1995-09-20|Banglore|      IISC|57120.5|   Google|  OOO@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

##### ORDER BY DESC

In [22]:
print("4D2). Sort by Name Descending order top 5 records")

sql_query="""SELECT * FROM Student_Table ORDER BY Name DESC LIMIT 5"""
spark.sql(sql_query).show()

4D2). Sort by Name Descending order top 5 records
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|124| XXX|     M|1991-12-19|     HYD|       IIT|60200.7|Microsoft|  XXX@gmail.com|
|123| WWW|     F|1994-09-14|  Mumbai|       VIT|59050.5|    Apple|WWW@hotmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
|121| UUU|     F|1990-11-13| Chennai|       NIT|59250.2|   Google|  UUU@gmail.com|
|120| TTT|     M|1995-09-29| Chennai|      IIIT|57230.5|    Apple|TTT@hotmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

# 4E. Upper() + Lower() + Length()

In [23]:
#Upper()-->Convert given column data into upper case data
#Lower()-->Convert given column data into lower case data
#Length()-->It will print total characters in columns data including spaces

print("4E1). Apply Upper(), Lower(), Length() functions to columns")

sql_query="""SELECT DISTINCT COMPANY,UPPER(COMPANY), LOWER(COMPANY), LENGTH(COMPANY) FROM Student_Table"""
spark.sql(sql_query).show()

4E1). Apply Upper(), Lower(), Length() functions to columns
+---------+--------------+--------------+---------------+
|  COMPANY|upper(COMPANY)|lower(COMPANY)|length(COMPANY)|
+---------+--------------+--------------+---------------+
|Microsoft|     MICROSOFT|     microsoft|              9|
|    Apple|         APPLE|         apple|              5|
|   Amazon|        AMAZON|        amazon|              6|
|   Google|        GOOGLE|        google|              6|
+---------+--------------+--------------+---------------+

# 4F. Concatination(||) + BooleanExpression + TRIM()

##### Concatination

In [24]:
#Concatination using ||
    #This will help to club mutiple columns and some text into single column

print("4F1). Concatination using || symbol")

sql_query="""SELECT 'I am ' || Name || ' from ' || University as SelfIntro FROM Student_Table LIMIT 10"""
spark.sql(sql_query).show()

4F1). Concatination using || symbol
+------------------+
|         SelfIntro|
+------------------+
|I am AAA from IISC|
|I am BBB from IIIT|
| I am CCC from NIT|
| I am DDD from VIT|
| I am EEE from IIT|
|I am FFF from IIIT|
| I am GGG from VIT|
| I am HHH from NIT|
|I am III from IIIT|
| I am JJJ from NIT|
+------------------+

##### Boolean Expression

In [25]:
#Boolean Expression with some condition:
    #THis will print True or False values 

print("4F2). Boolean Expression with some condition")

sql_query="""SELECT ID, NAME, SALARY, (Salary > 60000) As IsSalaryGraterThan60K FROM Student_Table LIMIT 10"""
spark.sql(sql_query).show()

4F2). Boolean Expression with some condition
+---+----+-------+---------------------+
| ID|NAME| SALARY|IsSalaryGraterThan60K|
+---+----+-------+---------------------+
|101| AAA|55000.5|                false|
|102| BBB|76000.2|                 true|
|103| CCC|49200.5|                false|
|104| DDD|54980.6|                false|
|105| EEE|60200.7|                 true|
|106| FFF|63100.8|                 true|
|107| GGG|60200.7|                 true|
|108| HHH|89200.7|                 true|
|109| III|66980.8|                 true|
|110| JJJ|59250.2|                false|
+---+----+-------+---------------------+

##### TRIM

In [26]:
#Trim() function used to remove extra spaces in column's data

print("4F3). Trim() function used to remove extra spaces in column's data")

sql_query="""SELECT 
'   Google    ' AS ExtraSpaces, LENGTH('   Google    ') AS Len_ExtraSpaces,
TRIM('   Google    ') AS TrimApplied, LENGTH(TRIM('   Google    ')) AS Len_TrimApplied
"""
spark.sql(sql_query).show()

4F3). Trim() function used to remove extra spaces in column's data
+-------------+---------------+-----------+---------------+
|  ExtraSpaces|Len_ExtraSpaces|TrimApplied|Len_TrimApplied|
+-------------+---------------+-----------+---------------+
|   Google    |             13|     Google|              6|
+-------------+---------------+-----------+---------------+

# 4G.SUBSTRING() + REPLACE() + POSITION()

##### SUBSTRING

In [27]:
#SUBSTRING() --> function extracts given range text from column 

print("4G1).Extract IIIT from IIIT Banglore")

sql_query="""SELECT 'IIIT Banglore' AS FullColumn, SUBSTRING('IIIT Banglore',1,4) AS SubstringColumn """
spark.sql(sql_query).show()

4G1).Extract IIIT from IIIT Banglore
+-------------+---------------+
|   FullColumn|SubstringColumn|
+-------------+---------------+
|IIIT Banglore|           IIIT|
+-------------+---------------+

##### REPLACE

In [28]:
#REPLACE() --> function will replace given text with given replaced value

print("4G2). Replace all IIIT to IIIT-B")

sql_query="""SELECT ID, Name, University, REPLACE(UNIVERSITY, 'IIIT', 'IIIT-B')AS Replaced FROM Student_Table LIMIT 10"""
spark.sql(sql_query).show()

4G2). Replace all IIIT to IIIT-B
+---+----+----------+--------+
| ID|Name|University|Replaced|
+---+----+----------+--------+
|101| AAA|      IISC|    IISC|
|102| BBB|      IIIT|  IIIT-B|
|103| CCC|       NIT|     NIT|
|104| DDD|       VIT|     VIT|
|105| EEE|       IIT|     IIT|
|106| FFF|      IIIT|  IIIT-B|
|107| GGG|       VIT|     VIT|
|108| HHH|       NIT|     NIT|
|109| III|      IIIT|  IIIT-B|
|110| JJJ|       NIT|     NIT|
+---+----+----------+--------+

##### POSITION

In [29]:
#POSITION() --> Will print the position number of given pattern or character or string

print("4G3).Print @ symbol position in Email column")

sql_query="""SELECT ID, Name, Email, POSITION('@' IN Email) AS PositionColumn FROM Student_Table LIMIT 10"""
spark.sql(sql_query).show()

4G3).Print @ symbol position in Email column
+---+----+---------------+--------------+
| ID|Name|          Email|PositionColumn|
+---+----+---------------+--------------+
|101| AAA|  AAA@gmail.com|             4|
|102| BBB|BBB@hotmail.com|             4|
|103| CCC|  CCC@gmail.com|             4|
|104| DDD|DDD@hotmail.com|             4|
|105| EEE|  EEE@gmail.com|             4|
|106| FFF|  FFF@gmail.com|             4|
|107| GGG|GGG@hotmail.com|             4|
|108| HHH|  HHH@gmail.com|             4|
|109| III|  III@gmail.com|             4|
|110| JJJ|JJJ@hotmail.com|             4|
+---+----+---------------+--------------+

# 4H. Aggregation Functions:

##### MAX()

In [30]:
#Sort table based on DOB Descending order

print("4H1-a).Print Table Based on Salary Descending order ")
sql_query="""SELECT * FROM Student_Table ORDER BY Salary DESC LIMIT 10"""
spark.sql(sql_query).show()


print("4H1-b).Print Maximum value in Salary")
sql_query="""SELECT MAX(Salary) AS MAX_Salary FROM Student_Table"""
spark.sql(sql_query).show()

4H1-a).Print Table Based on Salary Descending order
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|108| HHH|     M|1990-10-10|Banglore|       NIT|89200.7|    Apple|  HHH@gmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|102| BBB|     F|1995-09-20|     HYD|      IIIT|76000.2|   Amazon|BBB@hotmail.com|
|112| LLL|     F|1995-09-20|  Mumbai|       NIT|67900.8|    Apple|  LLL@gmail.com|
|109| III|     F|1994-12-21|     HYD|      IIIT|66980.8|   Google|  III@gmail.com|
|106| FFF|     M|1994-07-23|     HYD|      IIIT|63100.8|Microsoft|  FFF@gmail.com|
|119| SSS|     M|1992-10-25|     NaN|       VIT|62900.5|Microsoft|  SSS@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|113| MMM|     F|1994-10-15|     NaN|       VIT|60200.7|   Google|MMM@hotmail.com|
|107| GGG|     F|1994-10-10|  Mumbai|       VIT|60200.7|   Amazon|GGG@hotmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

4H1-b).Print Maximum value in Salary
+----------+
|MAX_Salary|
+----------+
|   89200.7|
+----------+

##### MIN()

In [31]:
#Sort table based on DOB Descending order

print("4H2-a).Print Table Based on Salary Assending order ")
sql_query="""SELECT * FROM Student_Table ORDER BY Salary LIMIT 10"""
spark.sql(sql_query).show()


print("4H2-b).Print Minimum value in Salary")
sql_query="""SELECT MIN(Salary) AS MIN_Salary FROM Student_Table"""
spark.sql(sql_query).show()

4H2-a).Print Table Based on Salary Assending order
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|103| CCC|     M|1992-12-31| Chennai|       NIT|49200.5|   Google|  CCC@gmail.com|
|118| RRR|     F|1993-11-10|  Mumbai|       NIT|52900.5|   Google|  RRR@gmail.com|
|104| DDD|     F|1990-11-22|  Mumbai|       VIT|54980.6|    Apple|DDD@hotmail.com|
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|115| OOO|     M|1995-09-20|Banglore|      IISC|57120.5|   Google|  OOO@gmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
|120| TTT|     M|1995-09-29| Chennai|      IIIT|57230.5|    Apple|TTT@hotmail.com|
|116| PPP|     F|1994-10-28| Chennai|       IIT|59050.5|    Apple|  PPP@gmail.com|
|123| WWW|     F|1994-09-14|  Mumbai|       VIT|59050.5|    Apple|WWW@hotmail.com|
|114| NNN|     F|1990-11-29|Banglore|      IIIT|59200.5|   Amazon|  NNN@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

4H2-b).Print Minimum value in Salary
+----------+
|MIN_Salary|
+----------+
|   49200.5|
+----------+

##### AVG() + SUM()

In [32]:
#AVG() for average, SUM() for sum values based on given condition on column
print("4H3).AVG(), SUM() functions")
sql_query="""SELECT AVG(Salary) AS AverageSalary, SUM(Salary) AS SumSalary FROM Student_Table"""
spark.sql(sql_query).show()

4H3).AVG(), SUM() functions
+-----------------+------------------+
|    AverageSalary|         SumSalary|
+-----------------+------------------+
|61780.98750000001|1482743.7000000002|
+-----------------+------------------+

# 4I. GROUP BY + HAVING

##### GROUP BY

In [33]:
#GROUP BY is used to group THE ROWS BASED ON SOME VALUE IN COLUMN 
    #GROUP BY mainly used in Aggregating functions.

print("4I1).Print number of Students working in each company ")
sql_query="""SELECT Company, count(*) TotalStudentsPerCompany FROM Student_Table GROUP BY Company"""
spark.sql(sql_query).show(30)

4I1).Print number of Students working in each company
+---------+-----------------------+
|  Company|TotalStudentsPerCompany|
+---------+-----------------------+
|   Google|                      6|
|Microsoft|                      8|
|    Apple|                      6|
|   Amazon|                      4|
+---------+-----------------------+

In [34]:
print("4I2).Print Total salary of Students based on company. Note:Round function used")
sql_query="""SELECT Company, ROUND(SUM(Salary)) TotalStudentsPerCompany FROM Student_Table GROUP BY Company"""
spark.sql(sql_query).show(30)

4I2).Print Total salary of Students based on company. Note:Round function used
+---------+-----------------------+
|  Company|TotalStudentsPerCompany|
+---------+-----------------------+
|   Google|               345653.0|
|Microsoft|               495025.0|
|    Apple|               387414.0|
|   Amazon|               254652.0|
+---------+-----------------------+

##### HAVING

In [35]:
#Having: Having cluase is used because where cluase cannot be used in Aggregated function. It acts like a filter
print("4I3).Print list of companies which recruites more than 5 students")

sql_query="""SELECT Company, COUNT(*) AS CompanyHaveMorethan5Stu 
FROM Student_Table 
GROUP BY Company 
HAVING CompanyHaveMorethan5Stu>5"""

spark.sql(sql_query).show(30)

4I3).Print list of companies which recruites more than 5 students
+---------+-----------------------+
|  Company|CompanyHaveMorethan5Stu|
+---------+-----------------------+
|   Google|                      6|
|Microsoft|                      8|
|    Apple|                      6|
+---------+-----------------------+

# 4J. Sub Queries

In [36]:
#SubQuery can be nested inside where cluase of another SELECT statement

print("4J1).Print Student details with uniersity having PlayGround. Hint: Only IIT, IIIT, IISC having PlayGround")
sql_query="""SELECT * 
FROM Student_Table 
WHERE University IN(
                    SELECT University 
                    FROM University_Table 
                    WHERE PlayGround = 'YES')"""
spark.sql(sql_query).show(30)

4J1).Print Student details with uniersity having PlayGround. Hint: Only IIT, IIIT, IISC having PlayGround
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|105| EEE|     M|1993-05-19| Chennai|       IIT|60200.7|Microsoft|  EEE@gmail.com|
|116| PPP|     F|1994-10-28| Chennai|       IIT|59050.5|    Apple|  PPP@gmail.com|
|124| XXX|     M|1991-12-19|     HYD|       IIT|60200.7|Microsoft|  XXX@gmail.com|
|102| BBB|     F|1995-09-20|     HYD|      IIIT|76000.2|   Amazon|BBB@hotmail.com|
|106| FFF|     M|1994-07-23|     HYD|      IIIT|63100.8|Microsoft|  FFF@gmail.com|
|109| III|     F|1994-12-21|     HYD|      IIIT|66980.8|   Google|  III@gmail.com|
|114| NNN|     F|1990-11-29|Banglore|      IIIT|59200.5|   Amazon|  NNN@gmail.com|
|120| TTT|     M|1995-09-29| Chennai|      IIIT|57230.5|    Apple|TTT@hotmail.com|
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|115| OOO|     M|1995-09-20|Banglore|      IISC|57120.5|   Google|  OOO@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|122| VVV|     M|1993-08-19|Banglore|      IISC|57120.5|Microsoft|  VVV@gmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+

# 4K. Corelated sub queries

In [37]:
#Corelated subqueries uses values of outer query. 
#Corelated subquery is executed repeatedly, once for each row evaluated by the outer query.

print("4K1).Example for Corelated subqueries")
sql_query="""SELECT ID, Name, Email, Location, University
FROM Student_Table o
WHERE EXISTS (
                    SELECT University 
                    FROM University_Table i
                    WHERE i.University = o.University )
                    
                    """
spark.sql(sql_query).show(30)

4K1).Example for Corelated subqueries
+---+----+---------------+--------+----------+
| ID|Name|          Email|Location|University|
+---+----+---------------+--------+----------+
|105| EEE|  EEE@gmail.com| Chennai|       IIT|
|116| PPP|  PPP@gmail.com| Chennai|       IIT|
|124| XXX|  XXX@gmail.com|     HYD|       IIT|
|102| BBB|BBB@hotmail.com|     HYD|      IIIT|
|106| FFF|  FFF@gmail.com|     HYD|      IIIT|
|109| III|  III@gmail.com|     HYD|      IIIT|
|114| NNN|  NNN@gmail.com|Banglore|      IIIT|
|120| TTT|TTT@hotmail.com| Chennai|      IIIT|
|101| AAA|  AAA@gmail.com|Banglore|      IISC|
|111| KKK|  KKK@gmail.com|Banglore|      IISC|
|115| OOO|  OOO@gmail.com|Banglore|      IISC|
|117| QQQ|QQQ@hotmail.com|Banglore|      IISC|
|122| VVV|  VVV@gmail.com|Banglore|      IISC|
+---+----+---------------+--------+----------+

# 4L. Case statement

In [38]:
#Case statement used to create new columns with some conditions. 
print("4L). Case Statement")
sql_query="""SELECT ID, Name, University, 
CASE 
    WHEN University = 'IIT' THEN 'IIT Student'
    WHEN University = 'IIIT' THEN 'IIIT Student'
    WHEN University = 'IISC' THEN 'IISC Student'
    ELSE 'Remaining Colleges' 
END TypeOfCollege  FROM Student_Table LIMIT 10"""
spark.sql(sql_query).show()

4L). Case Statement
+---+----+----------+------------------+
| ID|Name|University|     TypeOfCollege|
+---+----+----------+------------------+
|101| AAA|      IISC|      IISC Student|
|102| BBB|      IIIT|      IIIT Student|
|103| CCC|       NIT|Remaining Colleges|
|104| DDD|       VIT|Remaining Colleges|
|105| EEE|       IIT|       IIT Student|
|106| FFF|      IIIT|      IIIT Student|
|107| GGG|       VIT|Remaining Colleges|
|108| HHH|       NIT|Remaining Colleges|
|109| III|      IIIT|      IIIT Student|
|110| JJJ|       NIT|Remaining Colleges|
+---+----+----------+------------------+

# 4M. Joins (INNER, LEFT, RIGHT, OUTER, CROSS)

##### Inner Joins:

In [39]:
#Joins used for combining columns from multiple tables based on common columns in multiple tables.
#Inner--> This join will give results based on matching values in both tabels.

print("4M1).Inner Join:\nList Distinct Universities from Student_Table")
sql_query="""SELECT DISTINCT University FROM Student_Table"""
spark.sql(sql_query).show()

print("List Distinct Universities from University_Table")
sql_query="""SELECT DISTINCT University FROM University_Table"""
spark.sql(sql_query).show()

print("List matching Universities from both tables (Student_Table,University_Table)")
sql_query="""SELECT DISTINCT A.University 
FROM Student_Table A 
INNER JOIN University_Table B
ON A.University = B.University"""
spark.sql(sql_query).show()


print("Example Inner join Query")
sql_query="""SELECT A.ID, A.Name, A.University, B.PlayGround, B.Total_Students 
FROM Student_Table A 
INNER JOIN University_Table B
ON A.University = B.University"""
spark.sql(sql_query).show()

4M1).Inner Join:
List Distinct Universities from Student_Table
+----------+
|University|
+----------+
|       NIT|
|       IIT|
|      IIIT|
|      IISC|
|       VIT|
+----------+

List Distinct Universities from University_Table
+----------+
|University|
+----------+
|       IIT|
|      IIIT|
|      IISC|
|       MIT|
|      JNTU|
+----------+

List matching Universities from both tables (Student_Table,University_Table)
+----------+
|University|
+----------+
|       IIT|
|      IIIT|
|      IISC|
+----------+

Example Inner join Query
+---+----+----------+----------+--------------+
| ID|Name|University|PlayGround|Total_Students|
+---+----+----------+----------+--------------+
|105| EEE|       IIT|       YES|           240|
|116| PPP|       IIT|       YES|           240|
|124| XXX|       IIT|       YES|           240|
|102| BBB|      IIIT|       YES|           300|
|106| FFF|      IIIT|       YES|           300|
|109| III|      IIIT|       YES|           300|
|114| NNN|      IIIT|       YES|           300|
|120| TTT|      IIIT|       YES|           300|
|101| AAA|      IISC|       YES|           250|
|111| KKK|      IISC|       YES|           250|
|115| OOO|      IISC|       YES|           250|
|117| QQQ|      IISC|       YES|           250|
|122| VVV|      IISC|       YES|           250|
+---+----+----------+----------+--------------+

##### Left Join

In [40]:
#Left Join used for printing all records from Left table(Table-1) and matching records from right table(Table-2)
#for non matching records in right table(Table-2) willbe shown as Null

print("4M2). Example for Left Join Query")
sql_query="""SELECT A.ID, A.Name, A.University, A.Company, A.Salary, B.PlayGround, B.Total_Students 
FROM Student_Table A 
LEFT JOIN University_Table B
ON A.University = B.University"""
spark.sql(sql_query).show(30)

4M2). Example for Left Join Query
+---+----+----------+---------+-------+----------+--------------+
| ID|Name|University|  Company| Salary|PlayGround|Total_Students|
+---+----+----------+---------+-------+----------+--------------+
|103| CCC|       NIT|   Google|49200.5|      null|          null|
|108| HHH|       NIT|    Apple|89200.7|      null|          null|
|110| JJJ|       NIT|   Amazon|59250.2|      null|          null|
|112| LLL|       NIT|    Apple|67900.8|      null|          null|
|118| RRR|       NIT|   Google|52900.5|      null|          null|
|121| UUU|       NIT|   Google|59250.2|      null|          null|
|105| EEE|       IIT|Microsoft|60200.7|       YES|           240|
|116| PPP|       IIT|    Apple|59050.5|       YES|           240|
|124| XXX|       IIT|Microsoft|60200.7|       YES|           240|
|102| BBB|      IIIT|   Amazon|76000.2|       YES|           300|
|106| FFF|      IIIT|Microsoft|63100.8|       YES|           300|
|109| III|      IIIT|   Google|66980.8|       YES|           300|
|114| NNN|      IIIT|   Amazon|59200.5|       YES|           300|
|120| TTT|      IIIT|    Apple|57230.5|       YES|           300|
|101| AAA|      IISC|Microsoft|55000.5|       YES|           250|
|111| KKK|      IISC|Microsoft|76300.9|       YES|           250|
|115| OOO|      IISC|   Google|57120.5|       YES|           250|
|117| QQQ|      IISC|Microsoft|60200.7|       YES|           250|
|122| VVV|      IISC|Microsoft|57120.5|       YES|           250|
|104| DDD|       VIT|    Apple|54980.6|      null|          null|
|107| GGG|       VIT|   Amazon|60200.7|      null|          null|
|113| MMM|       VIT|   Google|60200.7|      null|          null|
|119| SSS|       VIT|Microsoft|62900.5|      null|          null|
|123| WWW|       VIT|    Apple|59050.5|      null|          null|
+---+----+----------+---------+-------+----------+--------------+

##### Right Join

In [41]:
#Right Join used for printing all records from Right table(Table-2) and matching records from left table(Table-1)
#for non matching records in left table(Table-1) willbe shown as Null

print("4M3). Example for RIGHT Join Query")
sql_query="""SELECT A.ID, A.Name, A.University, A.Company, A.Salary, B.PlayGround, B.Total_Students 
FROM Student_Table A 
RIGHT JOIN University_Table B
ON A.University = B.University"""
spark.sql(sql_query).show(30)

4M3). Example for RIGHT Join Query
+----+----+----------+---------+-------+----------+--------------+
|  ID|Name|University|  Company| Salary|PlayGround|Total_Students|
+----+----+----------+---------+-------+----------+--------------+
| 105| EEE|       IIT|Microsoft|60200.7|       YES|           240|
| 116| PPP|       IIT|    Apple|59050.5|       YES|           240|
| 124| XXX|       IIT|Microsoft|60200.7|       YES|           240|
| 102| BBB|      IIIT|   Amazon|76000.2|       YES|           300|
| 106| FFF|      IIIT|Microsoft|63100.8|       YES|           300|
| 109| III|      IIIT|   Google|66980.8|       YES|           300|
| 114| NNN|      IIIT|   Amazon|59200.5|       YES|           300|
| 120| TTT|      IIIT|    Apple|57230.5|       YES|           300|
| 101| AAA|      IISC|Microsoft|55000.5|       YES|           250|
| 111| KKK|      IISC|Microsoft|76300.9|       YES|           250|
| 115| OOO|      IISC|   Google|57120.5|       YES|           250|
| 117| QQQ|      IISC|Microsoft|60200.7|       YES|           250|
| 122| VVV|      IISC|Microsoft|57120.5|       YES|           250|
|null|null|      null|     null|   null|       YES|           230|
|null|null|      null|     null|   null|        NO|           250|
+----+----+----------+---------+-------+----------+--------------+

##### Full Outer Join

In [42]:
#Full Outer Join returns all the records in left join and all records in right join.

print("4M4). Example for FULL OUTER Join Query")
sql_query="""SELECT A.ID, A.Name, A.University, A.Company, A.Salary, B.PlayGround, B.Total_Students 
FROM Student_Table A 
FULL OUTER JOIN University_Table B
ON A.University = B.University 
ORDER BY ID"""
spark.sql(sql_query).show(50)

4M4). Example for FULL OUTER Join Query
+----+----+----------+---------+-------+----------+--------------+
|  ID|Name|University|  Company| Salary|PlayGround|Total_Students|
+----+----+----------+---------+-------+----------+--------------+
|null|null|      null|     null|   null|       YES|           230|
|null|null|      null|     null|   null|        NO|           250|
| 101| AAA|      IISC|Microsoft|55000.5|       YES|           250|
| 102| BBB|      IIIT|   Amazon|76000.2|       YES|           300|
| 103| CCC|       NIT|   Google|49200.5|      null|          null|
| 104| DDD|       VIT|    Apple|54980.6|      null|          null|
| 105| EEE|       IIT|Microsoft|60200.7|       YES|           240|
| 106| FFF|      IIIT|Microsoft|63100.8|       YES|           300|
| 107| GGG|       VIT|   Amazon|60200.7|      null|          null|
| 108| HHH|       NIT|    Apple|89200.7|      null|          null|
| 109| III|      IIIT|   Google|66980.8|       YES|           300|
| 110| JJJ|       NIT|   Amazon|59250.2|      null|          null|
| 111| KKK|      IISC|Microsoft|76300.9|       YES|           250|
| 112| LLL|       NIT|    Apple|67900.8|      null|          null|
| 113| MMM|       VIT|   Google|60200.7|      null|          null|
| 114| NNN|      IIIT|   Amazon|59200.5|       YES|           300|
| 115| OOO|      IISC|   Google|57120.5|       YES|           250|
| 116| PPP|       IIT|    Apple|59050.5|       YES|           240|
| 117| QQQ|      IISC|Microsoft|60200.7|       YES|           250|
| 118| RRR|       NIT|   Google|52900.5|      null|          null|
| 119| SSS|       VIT|Microsoft|62900.5|      null|          null|
| 120| TTT|      IIIT|    Apple|57230.5|       YES|           300|
| 121| UUU|       NIT|   Google|59250.2|      null|          null|
| 122| VVV|      IISC|Microsoft|57120.5|       YES|           250|
| 123| WWW|       VIT|    Apple|59050.5|      null|          null|
| 124| XXX|       IIT|Microsoft|60200.7|       YES|           240|
+----+----+----------+---------+-------+----------+--------------+

##### Cross Join

In [51]:
#CROSS JOIN produces a result set which is the number of rows in the first table multiplied by the number of rows in the second table if no WHERE clause is used along with CROSS JOIN.
#This kind of result is called as Cartesian Product.

print("4M5). Example for Cross Join Query")
print("\nCount of Student_Table = ",student_dfps.count())
print("\nCount of University_Table = ",university_dfps.count())
print("\nCount(Student_Table) X Count(University_Table) = ",student_dfps.count() * university_dfps.count())

sql_query="""SELECT A.ID, A.Name, A.University, B.University, A.Company, A.Salary, B.PlayGround, B.Total_Students 
FROM Student_Table A 
CROSS JOIN University_Table B
ORDER BY A.University, ID"""
spark.sql(sql_query).show(500)

4M5). Example for Cross Join Query

Count of Student_Table =  24

Count of University_Table =  5

Count(Student_Table) X Count(University_Table) =  120
+---+----+----------+----------+---------+-------+----------+--------------+
| ID|Name|University|University|  Company| Salary|PlayGround|Total_Students|
+---+----+----------+----------+---------+-------+----------+--------------+
|102| BBB|      IIIT|       MIT|   Amazon|76000.2|       YES|           230|
|102| BBB|      IIIT|      IISC|   Amazon|76000.2|       YES|           250|
|102| BBB|      IIIT|      IIIT|   Amazon|76000.2|       YES|           300|
|102| BBB|      IIIT|      JNTU|   Amazon|76000.2|        NO|           250|
|102| BBB|      IIIT|       IIT|   Amazon|76000.2|       YES|           240|
|106| FFF|      IIIT|       MIT|Microsoft|63100.8|       YES|           230|
|106| FFF|      IIIT|      IIIT|Microsoft|63100.8|       YES|           300|
|106| FFF|      IIIT|      IISC|Microsoft|63100.8|       YES|           250|
|106| FFF|      IIIT|       IIT|Microsoft|63100.8|       YES|           240|
|106| FFF|      IIIT|      JNTU|Microsoft|63100.8|        NO|           250|
|109| III|      IIIT|       IIT|   Google|66980.8|       YES|           240|
|109| III|      IIIT|       MIT|   Google|66980.8|       YES|           230|
|109| III|      IIIT|      IISC|   Google|66980.8|       YES|           250|
|109| III|      IIIT|      IIIT|   Google|66980.8|       YES|           300|
|109| III|      IIIT|      JNTU|   Google|66980.8|        NO|           250|
|114| NNN|      IIIT|       MIT|   Amazon|59200.5|       YES|           230|
|114| NNN|      IIIT|      IISC|   Amazon|59200.5|       YES|           250|
|114| NNN|      IIIT|      IIIT|   Amazon|59200.5|       YES|           300|
|114| NNN|      IIIT|      JNTU|   Amazon|59200.5|        NO|           250|
|114| NNN|      IIIT|       IIT|   Amazon|59200.5|       YES|           240|
|120| TTT|      IIIT|      IIIT|    Apple|57230.5|       YES|           300|
|120| TTT|      IIIT|      IISC|    Apple|57230.5|       YES|           250|
|120| TTT|      IIIT|      JNTU|    Apple|57230.5|        NO|           250|
|120| TTT|      IIIT|       IIT|    Apple|57230.5|       YES|           240|
|120| TTT|      IIIT|       MIT|    Apple|57230.5|       YES|           230|
|101| AAA|      IISC|       MIT|Microsoft|55000.5|       YES|           230|
|101| AAA|      IISC|      IISC|Microsoft|55000.5|       YES|           250|
|101| AAA|      IISC|      IIIT|Microsoft|55000.5|       YES|           300|
|101| AAA|      IISC|       IIT|Microsoft|55000.5|       YES|           240|
|101| AAA|      IISC|      JNTU|Microsoft|55000.5|        NO|           250|
|111| KKK|      IISC|      IIIT|Microsoft|76300.9|       YES|           300|
|111| KKK|      IISC|       MIT|Microsoft|76300.9|       YES|           230|
|111| KKK|      IISC|      IISC|Microsoft|76300.9|       YES|           250|
|111| KKK|      IISC|       IIT|Microsoft|76300.9|       YES|           240|
|111| KKK|      IISC|      JNTU|Microsoft|76300.9|        NO|           250|
|115| OOO|      IISC|       IIT|   Google|57120.5|       YES|           240|
|115| OOO|      IISC|       MIT|   Google|57120.5|       YES|           230|
|115| OOO|      IISC|      IISC|   Google|57120.5|       YES|           250|
|115| OOO|      IISC|      IIIT|   Google|57120.5|       YES|           300|
|115| OOO|      IISC|      JNTU|   Google|57120.5|        NO|           250|
|117| QQQ|      IISC|       MIT|Microsoft|60200.7|       YES|           230|
|117| QQQ|      IISC|      IISC|Microsoft|60200.7|       YES|           250|
|117| QQQ|      IISC|      IIIT|Microsoft|60200.7|       YES|           300|
|117| QQQ|      IISC|       IIT|Microsoft|60200.7|       YES|           240|
|117| QQQ|      IISC|      JNTU|Microsoft|60200.7|        NO|           250|
|122| VVV|      IISC|      JNTU|Microsoft|57120.5|        NO|           250|
|122| VVV|      IISC|       MIT|Microsoft|57120.5|       YES|           230|
|122| VVV|      IISC|      IIIT|Microsoft|57120.5|       YES|           300|
|122| VVV|      IISC|      IISC|Microsoft|57120.5|       YES|           250|
|122| VVV|      IISC|       IIT|Microsoft|57120.5|       YES|           240|
|105| EEE|       IIT|      IISC|Microsoft|60200.7|       YES|           250|
|105| EEE|       IIT|      IIIT|Microsoft|60200.7|       YES|           300|
|105| EEE|       IIT|      JNTU|Microsoft|60200.7|        NO|           250|
|105| EEE|       IIT|       MIT|Microsoft|60200.7|       YES|           230|
|105| EEE|       IIT|       IIT|Microsoft|60200.7|       YES|           240|
|116| PPP|       IIT|       IIT|    Apple|59050.5|       YES|           240|
|116| PPP|       IIT|       MIT|    Apple|59050.5|       YES|           230|
|116| PPP|       IIT|      IISC|    Apple|59050.5|       YES|           250|
|116| PPP|       IIT|      IIIT|    Apple|59050.5|       YES|           300|
|116| PPP|       IIT|      JNTU|    Apple|59050.5|        NO|           250|
|124| XXX|       IIT|      IIIT|Microsoft|60200.7|       YES|           300|
|124| XXX|       IIT|      IISC|Microsoft|60200.7|       YES|           250|
|124| XXX|       IIT|       IIT|Microsoft|60200.7|       YES|           240|
|124| XXX|       IIT|       MIT|Microsoft|60200.7|       YES|           230|
|124| XXX|       IIT|      JNTU|Microsoft|60200.7|        NO|           250|
|103| CCC|       NIT|      IISC|   Google|49200.5|       YES|           250|
|103| CCC|       NIT|      IIIT|   Google|49200.5|       YES|           300|
|103| CCC|       NIT|      JNTU|   Google|49200.5|        NO|           250|
|103| CCC|       NIT|       MIT|   Google|49200.5|       YES|           230|
|103| CCC|       NIT|       IIT|   Google|49200.5|       YES|           240|
|108| HHH|       NIT|      IIIT|    Apple|89200.7|       YES|           300|
|108| HHH|       NIT|       IIT|    Apple|89200.7|       YES|           240|
|108| HHH|       NIT|       MIT|    Apple|89200.7|       YES|           230|
|108| HHH|       NIT|      IISC|    Apple|89200.7|       YES|           250|
|108| HHH|       NIT|      JNTU|    Apple|89200.7|        NO|           250|
|110| JJJ|       NIT|       MIT|   Amazon|59250.2|       YES|           230|
|110| JJJ|       NIT|      IIIT|   Amazon|59250.2|       YES|           300|
|110| JJJ|       NIT|       IIT|   Amazon|59250.2|       YES|           240|
|110| JJJ|       NIT|      IISC|   Amazon|59250.2|       YES|           250|
|110| JJJ|       NIT|      JNTU|   Amazon|59250.2|        NO|           250|
|112| LLL|       NIT|      IIIT|    Apple|67900.8|       YES|           300|
|112| LLL|       NIT|       MIT|    Apple|67900.8|       YES|           230|
|112| LLL|       NIT|      IISC|    Apple|67900.8|       YES|           250|
|112| LLL|       NIT|      JNTU|    Apple|67900.8|        NO|           250|
|112| LLL|       NIT|       IIT|    Apple|67900.8|       YES|           240|
|118| RRR|       NIT|      JNTU|   Google|52900.5|        NO|           250|
|118| RRR|       NIT|      IISC|   Google|52900.5|       YES|           250|
|118| RRR|       NIT|      IIIT|   Google|52900.5|       YES|           300|
|118| RRR|       NIT|       MIT|   Google|52900.5|       YES|           230|
|118| RRR|       NIT|       IIT|   Google|52900.5|       YES|           240|
|121| UUU|       NIT|       IIT|   Google|59250.2|       YES|           240|
|121| UUU|       NIT|      IIIT|   Google|59250.2|       YES|           300|
|121| UUU|       NIT|       MIT|   Google|59250.2|       YES|           230|
|121| UUU|       NIT|      IISC|   Google|59250.2|       YES|           250|
|121| UUU|       NIT|      JNTU|   Google|59250.2|        NO|           250|
|104| DDD|       VIT|       IIT|    Apple|54980.6|       YES|           240|
|104| DDD|       VIT|      IIIT|    Apple|54980.6|       YES|           300|
|104| DDD|       VIT|      JNTU|    Apple|54980.6|        NO|           250|
|104| DDD|       VIT|      IISC|    Apple|54980.6|       YES|           250|
|104| DDD|       VIT|       MIT|    Apple|54980.6|       YES|           230|
|107| GGG|       VIT|      IISC|   Amazon|60200.7|       YES|           250|
|107| GGG|       VIT|      JNTU|   Amazon|60200.7|        NO|           250|
|107| GGG|       VIT|       MIT|   Amazon|60200.7|       YES|           230|
|107| GGG|       VIT|       IIT|   Amazon|60200.7|       YES|           240|
|107| GGG|       VIT|      IIIT|   Amazon|60200.7|       YES|           300|
|113| MMM|       VIT|      IISC|   Google|60200.7|       YES|           250|
|113| MMM|       VIT|       MIT|   Google|60200.7|       YES|           230|
|113| MMM|       VIT|      IIIT|   Google|60200.7|       YES|           300|
|113| MMM|       VIT|       IIT|   Google|60200.7|       YES|           240|
|113| MMM|       VIT|      JNTU|   Google|60200.7|        NO|           250|
|119| SSS|       VIT|      IIIT|Microsoft|62900.5|       YES|           300|
|119| SSS|       VIT|      IISC|Microsoft|62900.5|       YES|           250|
|119| SSS|       VIT|       MIT|Microsoft|62900.5|       YES|           230|
|119| SSS|       VIT|       IIT|Microsoft|62900.5|       YES|           240|
|119| SSS|       VIT|      JNTU|Microsoft|62900.5|        NO|           250|
|123| WWW|       VIT|      IIIT|    Apple|59050.5|       YES|           300|
|123| WWW|       VIT|      IISC|    Apple|59050.5|       YES|           250|
|123| WWW|       VIT|       IIT|    Apple|59050.5|       YES|           240|
|123| WWW|       VIT|       MIT|    Apple|59050.5|       YES|           230|
|123| WWW|       VIT|      JNTU|    Apple|59050.5|        NO|           250|
+---+----+----------+----------+---------+-------+----------+--------------+

# 4N. Union, Union all, Except

##### Union

In [50]:
#Union: Will combine 2 or more results from select statements without duplicates.
print("4N2).Union All--> Combine all results from multiple select statements.Duplicates are not Allowed")
sql_query="""SELECT University FROM Student_Table
UNION
SELECT University FROM University_Table
"""
spark.sql(sql_query).show(30)

4N2).Union All--> Combine all results from multiple select statements.Duplicates are not Allowed
+----------+
|University|
+----------+
|       NIT|
|       IIT|
|      IIIT|
|      IISC|
|       VIT|
|       MIT|
|      JNTU|
+----------+

##### Union all

In [49]:
#Union: Will combine 2 or more results from select statements without duplicates.
print("4N2).Union All--> Combine all results from multiple select statements.Duplicates are awllowed")
sql_query="""SELECT University FROM Student_Table
UNION ALL
SELECT University FROM University_Table
"""
spark.sql(sql_query).show(30)

4N2).Union All--> Combine all results from multiple select statements.Duplicates are awllowed
+----------+
|University|
+----------+
|      IISC|
|      IIIT|
|       NIT|
|       VIT|
|       IIT|
|      IIIT|
|       VIT|
|       NIT|
|      IIIT|
|       NIT|
|      IISC|
|       NIT|
|       VIT|
|      IIIT|
|      IISC|
|       IIT|
|      IISC|
|       NIT|
|       VIT|
|      IIIT|
|       NIT|
|      IISC|
|       VIT|
|       IIT|
|      IISC|
|      IIIT|
|       MIT|
|       IIT|
|      JNTU|
+----------+

##### Except

In [52]:
#Except: acts like Minus operator, it will print extra records in first results than second results
print("4N3).Except: acts like Minus operator")
sql_query="""SELECT University FROM Student_Table
EXCEPT
SELECT University FROM University_Table
"""
spark.sql(sql_query).show(30)

4N3).Except: acts like Minus operator
+----------+
|University|
+----------+
|       NIT|
|       VIT|
+----------+

# Ruff

In [44]:
#
print("4).")
sql_query="""SELECT * FROM Student_Table"""
spark.sql(sql_query).show()

4).
+---+----+------+----------+--------+----------+-------+---------+---------------+
| ID|Name|Gender|       DOB|Location|University| Salary|  Company|          Email|
+---+----+------+----------+--------+----------+-------+---------+---------------+
|101| AAA|     M|1994-10-10|Banglore|      IISC|55000.5|Microsoft|  AAA@gmail.com|
|102| BBB|     F|1995-09-20|     HYD|      IIIT|76000.2|   Amazon|BBB@hotmail.com|
|103| CCC|     M|1992-12-31| Chennai|       NIT|49200.5|   Google|  CCC@gmail.com|
|104| DDD|     F|1990-11-22|  Mumbai|       VIT|54980.6|    Apple|DDD@hotmail.com|
|105| EEE|     M|1993-05-19| Chennai|       IIT|60200.7|Microsoft|  EEE@gmail.com|
|106| FFF|     M|1994-07-23|     HYD|      IIIT|63100.8|Microsoft|  FFF@gmail.com|
|107| GGG|     F|1994-10-10|  Mumbai|       VIT|60200.7|   Amazon|GGG@hotmail.com|
|108| HHH|     M|1990-10-10|Banglore|       NIT|89200.7|    Apple|  HHH@gmail.com|
|109| III|     F|1994-12-21|     HYD|      IIIT|66980.8|   Google|  III@gmail.com|
|110| JJJ|     M|1990-11-22| Chennai|       NIT|59250.2|   Amazon|JJJ@hotmail.com|
|111| KKK|     M|1994-10-10|Banglore|      IISC|76300.9|Microsoft|  KKK@gmail.com|
|112| LLL|     F|1995-09-20|  Mumbai|       NIT|67900.8|    Apple|  LLL@gmail.com|
|113| MMM|     F|1994-10-15|     NaN|       VIT|60200.7|   Google|MMM@hotmail.com|
|114| NNN|     F|1990-11-29|Banglore|      IIIT|59200.5|   Amazon|  NNN@gmail.com|
|115| OOO|     M|1995-09-20|Banglore|      IISC|57120.5|   Google|  OOO@gmail.com|
|116| PPP|     F|1994-10-28| Chennai|       IIT|59050.5|    Apple|  PPP@gmail.com|
|117| QQQ|     M|1991-02-10|Banglore|      IISC|60200.7|Microsoft|QQQ@hotmail.com|
|118| RRR|     F|1993-11-10|  Mumbai|       NIT|52900.5|   Google|  RRR@gmail.com|
|119| SSS|     M|1992-10-25|     NaN|       VIT|62900.5|Microsoft|  SSS@gmail.com|
|120| TTT|     M|1995-09-29| Chennai|      IIIT|57230.5|    Apple|TTT@hotmail.com|
+---+----+------+----------+--------+----------+-------+---------+---------------+
only showing top 20 rows

In [45]:
#python dict
dict1_Z = {"Name": ["A","B","C","D","E","F","G","H","I"],\
         "Weight":[70,61,83,60,92,69,84,71,77],\
         "Address":["HYD","Banglore","Chennai","Mumbai","Banglore","Mumbai","Chennai","Banglore","HYD"],\
         "DOB":["15-01-1990", "19-01-1996", "28-02-1999", "13-06-1989", "15-11-2000", "10-12-1995", "25-11-1998", "15-09-1994", "15-01-1996"],\
         "Batch":[2016, 2017, 2018, 2016, 2016, 2017, 2016, 2018, 2017],\
         "Salary":[51000.00, 46500.50, 52000.00, 51000.00, 52000.00, 75000.60, 64000.50, 52000.00, 46500.50]         
        }

#create pandas df
dfpd_z = pd.DataFrame(dict1_Z)
dfpd_z_dtype = {"Name":'str', "Weight":'int64', "Address":'str', "DOB":'datetime64', "Batch":'int64', "Salary":'float64' }
dfpd_z = dfpd_z.astype(dfpd_z_dtype)

In [46]:
#Schema for spark dataframe with Structtype, fields
schema_z = StructType([\
                     StructField("Name", StringType(), True),\
                     StructField("Weight", IntegerType(), True),\
                     StructField("Address", StringType(), True),\
                     StructField("DOB", DateType(), True),\
                     StructField("Batch", IntegerType(), True),\
                     StructField("Salary", DoubleType(), True)])

#create spark DF by passing pandas df with above schema
dfps_z = spark.createDataFrame(dfpd_z, schema_z)

In [47]:
dfps_z.show()

+----+------+--------+----------+-----+-------+
|Name|Weight| Address|       DOB|Batch| Salary|
+----+------+--------+----------+-----+-------+
|   A|    70|     HYD|1990-01-15| 2016|51000.0|
|   B|    61|Banglore|1996-01-19| 2017|46500.5|
|   C|    83| Chennai|1999-02-28| 2018|52000.0|
|   D|    60|  Mumbai|1989-06-13| 2016|51000.0|
|   E|    92|Banglore|2000-11-15| 2016|52000.0|
|   F|    69|  Mumbai|1995-10-12| 2017|75000.6|
|   G|    84| Chennai|1998-11-25| 2016|64000.5|
|   H|    71|Banglore|1994-09-15| 2018|52000.0|
|   I|    77|     HYD|1996-01-15| 2017|46500.5|
+----+------+--------+----------+-----+-------+